my-app/app/Services/AiScenarioWorkflowService.php

update `ai_scenario_assessment_versions` set `status` = 'archived', `ai_scenario_assessment_versions`.`updated_at` = '2026-07-07 03:14:01' where `ai_scenario_config_id` = 2 and `status` = 'published'
---
    public function publishVersion(AiScenarioAssessmentVersion $version): AiScenarioAssessmentVersion
    {
        if ($version->status === AiScenarioAssessmentVersion::STATUS_PUBLISHED) {
            throw ValidationException::withMessages([
                'status' => 'This assessment is already published.',
            ]);
        }

        if ($version->status !== AiScenarioAssessmentVersion::STATUS_APPROVED) {
            if (! in_array($version->status, AiScenarioAssessmentVersion::EDITABLE_STATUSES, true)) {
                throw ValidationException::withMessages([
                    'status' => 'This assessment cannot be published.',
                ]);
            }

            $version = $this->approveVersion($version);
        }

        $this->validateForPublish($version->config, $version);

        return DB::transaction(function () use ($version) {
            $config = $version->config;

            AiScenarioAssessmentVersion::query()
                ->where('ai_scenario_config_id', $config->id)
                ->where('status', AiScenarioAssessmentVersion::STATUS_PUBLISHED)
                ->update(['status' => AiScenarioAssessmentVersion::STATUS_ARCHIVED]);