my-app/app/Services/AiScenarioWorkflowService.php

select * from `training_modules` where `training_modules`.`id` in (6)
---
    public function regenerateQuestion(AiScenarioAssessmentVersion $version, int $questionNumber): AiScenarioAssessmentVersion
    {
        $version = $this->resolveEditableVersion($version, 'Question regenerated by AI');
        $config = $version->config()->with('trainingModule')->firstOrFail();

update `ai_scenario_configs` set `current_version_id` = 3, `ai_scenario_configs`.`updated_at` = '2026-07-07 03:00:22' where `id` = 2
---
    protected function forkForEdit(AiScenarioAssessmentVersion $version, string $changeNote): AiScenarioAssessmentVersion
    {
        $config = $version->config()->firstOrFail();
        $versionNumber = $this->nextVersionNumber($config);

        $new = AiScenarioAssessmentVersion::create([
            'ai_scenario_config_id' => $config->id,
            'version_number' => $versionNumber,
            'status' => AiScenarioAssessmentVersion::STATUS_UNDER_REVIEW,
            'disaster_type' => $version->disaster_type,
            'difficulty' => $version->difficulty,
            'estimated_time_minutes' => $version->estimated_time_minutes,
            'scenario_title' => $version->scenario_title,
            'title_en' => $version->title_en,
            'title_fil' => $version->title_fil,
            'generated_scenario' => $version->generated_scenario,
            'description_en' => $version->description_en,
            'description_fil' => $version->description_fil,
            'learning_objectives_en' => $version->learning_objectives_en,
            'learning_objectives_fil' => $version->learning_objectives_fil,
            'generated_questions' => $version->generated_questions,
            'generated_language' => $version->generated_language,
            'change_note' => $changeNote,
            'parent_version_id' => $version->id,
            'created_by' => portal_id(),
        ]);

        $config->update(['current_version_id' => $new->id]);

select max(`version_number`) as aggregate from `ai_scenario_assessment_versions` where `ai_scenario_config_id` = 2
---
    protected function nextVersionNumber(AiScenarioConfig $config): int
    {
        $max = (int) AiScenarioAssessmentVersion::query()
            ->where('ai_scenario_config_id', $config->id)
            ->max('version_number');