my-app/app/Services/AuditLogger.php

insert into `audit_logs` (`user_id`, `user_name`, `user_role`, `action`, `module`, `status`, `description`, `ip_address`, `user_agent`, `url`, `metadata`, `old_values`, `new_values`, `failure_reason`, `performed_at`, `updated_at`, `created_at`) values (3, 'Reymon', 'LGU_ADMIN', 'Published AI scenario assessment', 'AI Scenario Training', 'success', 'Module ID: 6 · Version 8', '127.0.0.1', 'Mozilla/5.0 (Windows NT 10.0; Win64; x64) AppleWebKit/537.36 (KHTML, like Gecko) Chrome/149.0.0.0 Safari/537.36', 'http://127.0.0.1:8000/admin/ai-scenario-config/2/versions/9/publish', null, null, null, null, '2026-07-07 03:14:01', '2026-07-07 03:14:01', '2026-07-07 03:14:01')
---
    public static function log(array $attributes): AuditLog
    {
        /** @var User|null $user */
        $user = $attributes['user'] ?? portal_user();
        unset($attributes['user']);

        $request = request();

        return AuditLog::create([
            'user_id' => $user?->id,
            'user_name' => $user?->name,
            'user_role' => $user?->role,
            'action' => $attributes['action'] ?? 'Unknown action',
            'module' => $attributes['module'] ?? null,
            'status' => $attributes['status'] ?? 'success',
            'description' => $attributes['description'] ?? null,
            'ip_address' => $attributes['ip_address'] ?? $request?->ip(),
            'user_agent' => $attributes['user_agent'] ?? ($request?->userAgent() ?? null),
            'url' => $attributes['url'] ?? ($request?->fullUrl() ?? null),
            'metadata' => $attributes['metadata'] ?? null,
            'old_values' => $attributes['old_values'] ?? null,
            'new_values' => $attributes['new_values'] ?? null,
            'failure_reason' => $attributes['failure_reason'] ?? null,
            'performed_at' => $attributes['performed_at'] ?? now(),
        ]);