my-app/app/Services/EvaluationScoringService.php

    public function buildAnalyticsSummary(): array
    {
        $results = EvaluationResult::query()->with('trainingModule')->get();
---
select * from `evaluation_results`
select * from `training_modules` where `training_modules`.`id` in (5)