my-app/app/Services/ParticipantRegistryService.php

select user_id, COUNT(*) as total from `lesson_completions` where `user_id` in (24, 8, 30, 28, 11, 18, 19, 17, 20, 16) group by `user_id`
select user_id, COUNT(*) as total from `ai_scenario_attempts` where `user_id` in (24, 8, 30, 28, 11, 18, 19, 17, 20, 16) and `status` = 'completed' group by `user_id`
select participant_id, COUNT(*) as total from `evaluation_results` where `participant_id` in (24, 8, 30, 28, 11, 18, 19, 17, 20, 16) group by `participant_id`
select user_id, COUNT(*) as total from `certificates` where `user_id` in (24, 8, 30, 28, 11, 18, 19, 17, 20, 16) and `revoked_at` is null group by `user_id`
---
    public function enrichMany(Collection|array $participants): Collection
    {
        $collection = $participants instanceof Collection ? $participants : collect($participants);
        $ids = $collection->pluck('id')->filter()->all();

        if ($ids === []) {
            return $collection;
        }

        $lessonCounts = LessonCompletion::query()
            ->whereIn('user_id', $ids)
            ->selectRaw('user_id, COUNT(*) as total')
            ->groupBy('user_id')
            ->pluck('total', 'user_id');

        $aiCompletedCounts = AiScenarioAttempt::query()
            ->whereIn('user_id', $ids)
            ->where('status', AiScenarioAttempt::STATUS_COMPLETED)
            ->selectRaw('user_id, COUNT(*) as total')
            ->groupBy('user_id')
            ->pluck('total', 'user_id');

        $evaluationCounts = EvaluationResult::query()
            ->whereIn('participant_id', $ids)
            ->selectRaw('participant_id, COUNT(*) as total')
            ->groupBy('participant_id')
            ->pluck('total', 'participant_id');

        $certificateCounts = Certificate::query()
            ->whereIn('user_id', $ids)
            ->whereNull('revoked_at')
            ->selectRaw('user_id, COUNT(*) as total')
            ->groupBy('user_id')
            ->pluck('total', 'user_id');

select distinct `barangay` from `users` where `role` = 'PARTICIPANT' and `barangay` is not null order by `barangay` asc
select distinct `city` from `users` where `role` = 'PARTICIPANT' and `city` is not null order by `city` asc
---
    public function buildFilterOptions(): array
    {
        $base = User::where('role', 'PARTICIPANT');

        return [
            'barangays' => (clone $base)->whereNotNull('barangay')->distinct()->orderBy('barangay')->pluck('barangay')->filter()->values()->all(),
            'municipalities' => (clone $base)->whereNotNull('city')->distinct()->orderBy('city')->pluck('city')->filter()->values()->all(),
        ];

select * from `attendances` where `attendances`.`user_id` = 24 and `attendances`.`user_id` is not null
---
    protected function resolveAttendanceStatus(User $user): string
    {
        $attendances = $user->relationLoaded('attendances')
            ? $user->attendances
            : $user->attendances()->get();