my-app/app/Http/Controllers/AiScenarioConfigController.php

select * from `ai_scenario_configs` where `ai_scenario_configs`.`training_module_id` in (5, 6)
select * from `training_modules` where `status` = 'published' order by `title` asc
select * from `ai_scenario_configs` order by `updated_at` desc
select * from `training_modules` where `training_modules`.`id` in (5)
---
    public function index()
    {
        $this->authorizeAdmin();

        $modules = TrainingModule::query()
            ->where('status', 'published')
            ->with('aiScenarioConfig')
            ->orderBy('title')
            ->get();

        $configs = AiScenarioConfig::with([
            'trainingModule',
            'creator',
            'currentVersion.creator',
            'publishedVersion',
            'versions' => fn ($q) => $q->with(['creator', 'approver'])->orderByDesc('version_number'),
        ])
            ->orderByDesc('updated_at')
            ->get();

select * from `training_modules` where `training_modules`.`id` = 6 limit 1
insert into `ai_scenario_configs` (`training_module_id`, `difficulty`, `number_of_questions`, `generation_language`, `is_enabled`, `time_limit_minutes`, `max_attempts`, `passing_score`, `fail_retake_policy`, `auto_submit_on_expire`, `allow_resume_attempt`, `shuffle_questions`, `shuffle_answer_choices`, `created_by`, `updated_at`, `created_at`) values (6, 'medium', 10, 'en', 1, 60, 3, 50, 'require_lesson_review', 1, 1, 1, 1, 3, '2026-07-07 02:54:50', '2026-07-07 02:54:50')
select * from `ai_scenario_configs` where (`training_module_id` = 6) limit 1
---
    public function store(StoreAiScenarioConfigRequest $request)
    {
        $this->authorizeAdmin();

        $data = $request->validated();

        $module = TrainingModule::with('contents')->findOrFail($data['training_module_id']);
        $difficulty = $this->trainingService->resolveDifficultyForModule($module);

        $config = AiScenarioConfig::updateOrCreate(
            ['training_module_id' => $data['training_module_id']],
            [
                'difficulty' => $difficulty,
                'number_of_questions' => $data['number_of_questions'],
                'generation_language' => $data['generation_language'] ?? 'en',
                'is_enabled' => $request->boolean('is_enabled'),
                'time_limit_minutes' => $data['time_limit_minutes'] ?? 60,
                'max_attempts' => $data['max_attempts'] ?? 3,
                'passing_score' => $data['passing_score'] ?? 75,
                'fail_retake_policy' => $data['fail_retake_policy'] ?? AiScenarioConfig::FAIL_POLICY_REQUIRE_LESSON_REVIEW,
                'auto_submit_on_expire' => $request->boolean('auto_submit_on_expire', true),
                'allow_resume_attempt' => $request->boolean('allow_resume_attempt', true),
                'shuffle_questions' => $request->boolean('shuffle_questions', true),
                'shuffle_answer_choices' => $request->boolean('shuffle_answer_choices', true),
                'created_by' => portal_id(),
            ],
        );

select * from `training_modules` where `training_modules`.`id` in (6)
---
        ]);

        if ($request->expectsJson()) {
            return response()->json([
                'message' => 'Configuration saved.',
                'config' => $config->fresh([
                    'trainingModule',
                    'currentVersion.creator',
                    'publishedVersion',
                    'versions' => fn ($q) => $q->with(['creator', 'approver'])->orderByDesc('version_number'),
                ]),
            ]);

select * from `training_modules` where `training_modules`.`id` in (6)
---
    public function generate(Request $request, AiScenarioConfig $config)
    {
        $this->authorizeAdmin();

        set_time_limit((int) config('ai_scenario.generation_max_execution_seconds', 300));

        try {
            $config = $this->trainingService->generateForConfig($config);

            AuditLogger::log([
                'action' => 'Generated AI scenario quiz',
                'module' => 'AI Scenario Training',
                'status' => 'success',
                'description' => $config->scenario_title,
            ]);

            if ($request->expectsJson()) {
                return response()->json([
                    'message' => 'Scenario and quiz generated successfully.',
                    'config' => $config->fresh([
                    'trainingModule',
                    'currentVersion.creator',
                    'publishedVersion',
                    'versions' => fn ($q) => $q->with(['creator', 'approver'])->orderByDesc('version_number'),
                ]),
                ]);