my-app/app/Http/Controllers/AiScenarioWorkflowController.php

    protected function serializeConfig(AiScenarioConfig $config): array
    {
        return [
            'id' => $config->id,
            'training_module_id' => $config->training_module_id,
            'training_module' => $config->trainingModule,
            'difficulty' => $config->difficulty,
            'number_of_questions' => $config->number_of_questions,
            'generation_language' => $config->generation_language,
            'is_enabled' => $config->is_enabled,
            'time_limit_minutes' => $config->time_limit_minutes,
            'max_attempts' => $config->max_attempts,
            'passing_score' => $config->passing_score,
            'fail_retake_policy' => $config->fail_retake_policy,
            'auto_submit_on_expire' => $config->auto_submit_on_expire,
            'allow_resume_attempt' => $config->allow_resume_attempt,
            'shuffle_questions' => $config->shuffle_questions,
            'shuffle_answer_choices' => $config->shuffle_answer_choices,
            'current_version_id' => $config->current_version_id,
            'published_version_id' => $config->published_version_id,
            'current_version' => $config->currentVersion ? $this->serializeVersion($config->currentVersion) : null,
            'published_version' => $config->publishedVersion ? $this->serializeVersion($config->publishedVersion) : null,
            'versions' => $config->versions?->map(fn ($v) => $this->serializeVersion($v))->values() ?? [],
            'generated_at' => $config->generated_at,
---
select * from `training_modules` where `training_modules`.`id` in (6)