my-app/app/Http/Controllers/AttendanceController.php

    public function index(Request $request, SimulationEvent $simulationEvent)
    {
        $this->authorizeAttendanceAccess();

        $registrations = $simulationEvent->registrations()
            ->where('status', 'approved')
            ->with(['user', 'attendance'])
            ->orderBy('registered_at', 'desc')
            ->get();
---
select * from `attendances` where `attendances`.`event_registration_id` in (2, 3, 4, 5, 6, 11, 12, 13, 16, 18, 19, 20)
select * from `users` where `users`.`id` in (15, 16, 17, 18, 19, 24, 25, 26, 29, 31, 32, 33)