my-app/app/Http/Controllers/AuthController.php

    public function login(Request $request, LoginAttemptService $loginAttempts)
    {
        $credentials = $request->validate([
            'email' => ['required', 'email'],
            'password' => ['required'],
        ]);

        $email = $credentials['email'];
        $ip = $request->ip() ?? '0.0.0.0';

        $lockout = $loginAttempts->isLockedOut($email, $ip);
        if ($lockout !== null) {
            $seconds = $lockout['retry_after_seconds'];
            return back()
                ->withErrors([
                    'email' => "Too many failed login attempts. Please wait {$seconds} seconds before trying again.",
                ])
                ->with('lockout_retry_after', $seconds)
                ->onlyInput('email');
        }

        /** @var \App\Models\User|null $user */
        $user = User::where('email', $email)->first();
---
select * from `users` where `email` = 'Brogada.reymon09@gmail.com' limit 1

    public function resendAdminLoginOtp(Request $request)
    {
        $otpData = $request->session()->get('admin_login_otp');

        if (! $otpData || empty($otpData['user_id'])) {
            return redirect()->route('admin.login')
                ->withErrors(['email' => 'Your login session has expired. Please log in again.']);
        }

        $user = User::find($otpData['user_id']);
---
select * from `users` where `users`.`id` = 3 limit 1