my-app/app/Http/Controllers/DashboardController.php

    public function index(Request $request)
    {
        $user = portal_user();
        if (! $user) {
            $loginRoute = PortalAuth::activeGuard() === PortalAuth::PARTICIPANT_GUARD
                ? 'participant.login'
                : 'admin.login';

            return redirect()->route($loginRoute);
        }

        // Normalize event statuses (same as SimulationEventController)
        SimulationEvent::autoEndPastUnstartedEvents($user->id);
        $this->autoCompleteExpiredEvents();

        // Load data appropriate to role
        if ($user->role === 'PARTICIPANT') {
            $modules = TrainingModule::with('owner')
                ->where('status', 'published')
                ->orderByDesc('updated_at')
                ->get();
            $events = SimulationEvent::with(['scenario', 'registrations'])
                ->whereIn('status', ['published', 'ongoing', 'ended', 'completed', 'archived'])
                ->where('event_date', '>=', now()->subDays(7))
                ->orderBy('event_date')
                ->orderBy('start_time')
                ->get();
            $participants = collect(); // Participants list not for participant role
        } else {
            $modules = TrainingModule::with('owner')
                ->orderByDesc('updated_at')
                ->get();
---
select * from `training_modules` order by `updated_at` desc

                ->orderByDesc('event_date')
                ->orderByDesc('created_at')
                ->get();
            $participants = User::where('role', 'PARTICIPANT')
                ->orderByDesc('created_at')
                ->get();
---
select * from `users` where `role` = 'PARTICIPANT' order by `created_at` desc

        })->count();
        $totalParticipants = $participants->count();
        $certificatesCount = $user->role !== 'PARTICIPANT'
            ? Certificate::whereNull('revoked_at')->count()
---
select count(*) as aggregate from `certificates` where `revoked_at` is null

        $pendingEvaluationsCount = 0;
        if ($user->role !== 'PARTICIPANT') {
            $completedEventIds = $events->where('status', 'completed')->pluck('id');
            foreach (Evaluation::whereIn('simulation_event_id', $completedEventIds)->get() as $eval) {
                $presentCount = Attendance::where('simulation_event_id', $eval->simulation_event_id)->where('status', 'present')->count();
                $evaluatedCount = ParticipantEvaluation::where('evaluation_id', $eval->id)->whereNotNull('submitted_at')->count();
---
select * from `evaluations` where `simulation_event_id` in (2)
select count(*) as aggregate from `attendances` where `simulation_event_id` = 2 and `status` = 'present'
select count(*) as aggregate from `participant_evaluations` where `evaluation_id` = 1 and `submitted_at` is not null

        // Pending certificates: eligible participants without certificate for completed events (simplified)
        $pendingCertificatesCount = 0;
        if ($user->role !== 'PARTICIPANT') {
            $eligible = ParticipantEvaluation::where('is_eligible_for_certification', true)->whereNotNull('submitted_at')->count();
            $issued = Certificate::whereNull('revoked_at')->count();
---
select count(*) as aggregate from `participant_evaluations` where `is_eligible_for_certification` = 1 and `submitted_at` is not null
select count(*) as aggregate from `certificates` where `revoked_at` is null

        $attendanceRate = null;
        if ($user->role !== 'PARTICIPANT') {
            $submitted = ParticipantEvaluation::whereNotNull('submitted_at');
            $submittedCount = $submitted->count();
            if ($submittedCount > 0) {
                $averageScore = round((float) ParticipantEvaluation::whereNotNull('submitted_at')->avg('average_score'), 1);
                $passedCount = ParticipantEvaluation::whereNotNull('submitted_at')->where('result', 'passed')->count();
                $passRate = $submittedCount > 0 ? round(100 * $passedCount / $submittedCount, 0) : null;
            }
            $totalPresent = Attendance::where('status', 'present')->count();
            $totalMarked = Attendance::count();
---
select count(*) as aggregate from `participant_evaluations` where `submitted_at` is not null
select avg(`average_score`) as aggregate from `participant_evaluations` where `submitted_at` is not null
select count(*) as aggregate from `participant_evaluations` where `submitted_at` is not null and `result` = 'passed'
select count(*) as aggregate from `attendances` where `status` = 'present'
select count(*) as aggregate from `attendances`

                ? "CAST(strftime('%m', submitted_at) AS INTEGER)"
                : 'MONTH(submitted_at)';

            $perMonth = ParticipantEvaluation::whereNotNull('submitted_at')
                ->whereYear('submitted_at', $year)
                ->selectRaw("{$monthSql} as month, AVG(average_score) as avg_score")
                ->groupByRaw($monthSql)
                ->orderBy('month')
                ->get();
---
select MONTH(submitted_at) as month, AVG(average_score) as avg_score from `participant_evaluations` where `submitted_at` is not null and year(`submitted_at`) = 2026 group by MONTH(submitted_at) order by `month` asc


            // Evaluation status overview donut – align with participant view semantics
            // Consider all drills that have an Evaluation record (not only completed),
            // so in‑progress events also appear on the dashboard.
            $evaluationEventIds = Evaluation::pluck('simulation_event_id');

            $presentAttendances = Attendance::whereIn('simulation_event_id', $evaluationEventIds)
                ->where('status', 'present')
                ->get();

            $evaluations = ParticipantEvaluation::whereHas('evaluation', function ($q) use ($evaluationEventIds) {
                $q->whereIn('simulation_event_id', $evaluationEventIds);
            })
            ->get()
            ->keyBy('attendance_id');
---
select `simulation_event_id` from `evaluations`
select * from `attendances` where `simulation_event_id` in (2) and `status` = 'present'
select * from `participant_evaluations` where exists (select * from `evaluations` where `participant_evaluations`.`evaluation_id` = `evaluations`.`id` and `simulation_event_id` in (2))

    protected function autoCompleteExpiredEvents(): void
    {
        $now = now();
        SimulationEvent::where('status', 'ongoing')
            ->whereDate('event_date', '<=', $now->toDateString())
            ->get()
            ->each(function ($event) use ($now) {
                $endTime = $event->end_time;
                if (! $endTime) return;
                try {
                    [$endHour, $endMinute] = explode(':', $endTime);
                    $eventEnd = $event->event_date->copy()->setTime((int) $endHour, (int) $endMinute, 0);
                    if ($now->greaterThanOrEqualTo($eventEnd)) {
                        $event->update([
                            'status' => 'completed',
                            'completed_at' => $now,
                            'updated_by' => portal_id(),
                        ]);
                    }
                } catch (\Exception $e) {
                    // skip
                }
            });
---
select * from `simulation_events` where `status` = 'ongoing' and date(`event_date`) <= '2026-07-07'