my-app/app/Http/Controllers/EventRegistrationController.php

    public function index(SimulationEvent $simulationEvent)
    {
        $this->authorizeRegistrationAccess();

        $registrations = $simulationEvent->registrations()
            ->with(['user', 'attendance', 'approver'])
            ->orderBy('registered_at', 'desc')
            ->get();
---
select * from `attendances` where `attendances`.`event_registration_id` in (2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16, 17, 18, 19, 20)
select * from `users` where `users`.`id` in (15, 16, 17, 18, 19, 20, 21, 22, 23, 24, 25, 26, 27, 28, 29, 30, 31, 32, 33)