my-app/app/Http/Controllers/HazardAssessmentProfileController.php

select * from `barangay_profiles`
---
    public static function buildListResponse(Request $request): array
    {
        $service = app(HazardTrainingRecommendationService::class);
        $allProfiles = BarangayProfile::with('hazardRecords')->get();