my-app/app/Http/Controllers/ParticipantController.php

select count(*) as aggregate from `users` where `role` = 'PARTICIPANT' and `last_synced_at` >= '2026-07-01 00:00:00'
---
    public function index(Request $request)
    {
        $this->authorizeParticipantAccess();

        $summaryBase = User::where('role', 'PARTICIPANT');
        $startOfMonth = now()->startOfMonth();

        $participantsSummary = [
            'total' => (clone $summaryBase)->count(),
            'active' => (clone $summaryBase)->where('status', 'active')->count(),
            'inactive' => (clone $summaryBase)->where('status', 'inactive')->count(),
            'synced_this_month' => (clone $summaryBase)->where('last_synced_at', '>=', $startOfMonth)->count(),
            'local' => (clone $summaryBase)->where(function ($query) {
                $query->whereNull('group6_external_id')
                    ->where(function ($inner) {
                        $inner->whereNull('registration_source')
                            ->orWhereNotIn('registration_source', ['synced', 'campaign_planning_scheduling']);
                    });
            })->count(),
            'campaign' => (clone $summaryBase)->where(function ($query) {
                $query->whereNotNull('group6_external_id')
                    ->orWhereIn('registration_source', ['synced', 'campaign_planning_scheduling']);
            })->count(),
        ];