my-app/app/Http/Controllers/PermissionController.php

    public function index(Request $request)
    {
        $user = portal_user();

        if (! $user || $user->role !== 'LGU_ADMIN') {
            abort(403);
        }

        $permissions = collect([]);

        try {
            // Check if permissions table exists
            if (DB::getSchemaBuilder()->hasTable('permissions')) {
                $query = DB::table('permissions');

                // Search by name
                if ($search = $request->query('search')) {
                    $query->where('name', 'like', '%' . $search . '%');
                }

                $permissions = $query->get();

                // Get role counts for each permission
                if (DB::getSchemaBuilder()->hasTable('role_has_permissions')) {
                    foreach ($permissions as $permission) {
                        $roleCount = DB::table('role_has_permissions')
                            ->where('permission_id', $permission->id)
                            ->count();
---
select * from `permissions`
select count(*) as aggregate from `role_has_permissions` where `permission_id` = 1