my-app/app/Http/Controllers/PhilippinesLocationController.php

select `id`, `name`, `psgc_code` from `philippine_regions` order by `name` asc
---
    public function regions()
    {
        return response()->json([
            'regions' => PhilippineRegion::orderBy('name')->get(['id', 'name', 'psgc_code']),
        ]);

select `id`, `name`, `psgc_code`, `region_id` from `philippine_provinces` where `region_id` = 1 order by `name` asc
---
    public function provinces(Request $request)
    {
        $request->validate(['region_id' => ['required', 'integer', 'exists:philippine_regions,id']]);

        $provinces = PhilippineProvince::query()
            ->where('region_id', $request->integer('region_id'))
            ->orderBy('name')
            ->get(['id', 'name', 'psgc_code', 'region_id']);

select `id`, `name`, `psgc_code`, `region_id`, `province_id`, `type` from `philippine_cities` where `province_id` = 1 order by `name` asc
---
    public function cities(Request $request)
    {
        $request->validate([
            'region_id' => ['nullable', 'integer', 'exists:philippine_regions,id'],
            'province_id' => ['nullable', 'integer', 'exists:philippine_provinces,id'],
        ]);

        $query = PhilippineCity::query()->orderBy('name');

        if ($request->filled('province_id')) {
            $query->where('province_id', $request->integer('province_id'));
        } elseif ($request->filled('region_id')) {
            $query->where('region_id', $request->integer('region_id'));
        } else {
            return response()->json(['cities' => []]);
        }

        return response()->json([
            'cities' => $query->get(['id', 'name', 'psgc_code', 'region_id', 'province_id', 'type']),
        ]);