my-app/app/Http/Controllers/QualifiedTrainerController.php

    public static function buildListResponse(Request $request): array
    {
        $summaryBase = QualifiedTrainer::query();
        $trainersSummary = [
            'total' => (clone $summaryBase)->count(),
            'active' => (clone $summaryBase)->where('status', QualifiedTrainer::STATUS_ACTIVE)->count(),
            'inactive' => (clone $summaryBase)->where('status', QualifiedTrainer::STATUS_INACTIVE)->count(),
            'synced_this_month' => (clone $summaryBase)
                ->where('last_synced_at', '>=', now()->startOfMonth())
                ->count(),
---
select count(*) as aggregate from `qualified_trainers` where `status` = 'active'
select count(*) as aggregate from `qualified_trainers` where `status` = 'inactive'
select count(*) as aggregate from `qualified_trainers` where `last_synced_at` >= '2026-07-01 00:00:00'