my-app/app/Http/Controllers/ResourceController.php

select * from `resources` limit 15 offset 0
select count(*) as aggregate from `resources`
---
    public function index(Request $request)
    {
        $query = Resource::query();

        // Search by name or serial number
        if ($request->has('search')) {
            $query->where('name', 'like', "%{$request->search}%")
                  ->orWhere('serial_number', 'like', "%{$request->search}%");
        }

        // Filter by category
        if ($request->has('category') && $request->category !== 'all') {
            $query->where('category', $request->category);
        }

        // Filter by status
        if ($request->has('status') && $request->status !== 'all') {
            $query->where('status', $request->status);
        }

        // Filter by condition
        if ($request->has('condition') && $request->condition !== 'all') {
            $query->where('condition', $request->condition);
        }

        $resources = $query->with(['assignedEvent', 'assignedHandler', 'creator'])->paginate(15);

select count(*) as aggregate from `resources` where `status` = 'Available'
select count(*) as aggregate from `resources` where `status` = 'In Use'
select count(*) as aggregate from `resources` where `condition` = 'Needs Repair' or `status` = 'Damaged'
---
            'resources' => $resources,
            'stats' => [
                'total' => Resource::count(),
                'available' => Resource::where('status', 'Available')->count(),
                'pendingApproval' => Resource::where('status', 'Pending Approval')->count(),
                'reserved' => Resource::where('status', 'Reserved')->count(),
                'inUse' => Resource::where('status', 'In Use')->count(),
                'needsRepair' => Resource::where('condition', 'Needs Repair')->orWhere('status', 'Damaged')->count(),