my-app/app/Http/Controllers/RoleController.php

select * from `roles`
select count(*) as aggregate from `role_has_permissions` where `role_id` = 1
---
    public function index(Request $request)
    {
        $user = portal_user();

        if (! $user || $user->role !== 'LGU_ADMIN') {
            abort(403);
        }

        $roles = collect([]);

        try {
            // Check if roles table exists
            if (DB::getSchemaBuilder()->hasTable('roles')) {
                $query = DB::table('roles');

                // Search by name
                if ($search = $request->query('search')) {
                    $query->where('name', 'like', '%' . $search . '%');
                }

                $roles = $query->get();

                // Get permission counts for each role
                if (DB::getSchemaBuilder()->hasTable('role_has_permissions')) {
                    foreach ($roles as $role) {
                        $permissionCount = DB::table('role_has_permissions')
                            ->where('role_id', $role->id)
                            ->count();

select * from `roles` where `id` = '2' limit 1
select * from `permissions` order by `name` asc
select `permission_id` from `role_has_permissions` where `role_id` = '2'
---
    public function edit($id)
    {
        $user = portal_user();

        if (! $user || $user->role !== 'LGU_ADMIN') {
            abort(403);
        }

        try {
            if (! DB::getSchemaBuilder()->hasTable('roles')) {
                abort(404, 'Roles table does not exist');
            }

            $role = DB::table('roles')->where('id', $id)->first();

            if (! $role) {
                abort(404, 'Role not found');
            }

            // Get all permissions grouped by module
            $allPermissions = collect([]);
            if (DB::getSchemaBuilder()->hasTable('permissions')) {
                $allPermissions = DB::table('permissions')
                    ->orderBy('name')
                    ->get();
            }

            // Get role's assigned permissions
            $assignedPermissionIds = collect([]);
            if (DB::getSchemaBuilder()->hasTable('role_has_permissions')) {
                $assignedPermissionIds = DB::table('role_has_permissions')
                    ->where('role_id', $id)
                    ->pluck('permission_id');