my-app/app/Http/Controllers/SimulationEventController.php

select * from `scenarios` where `status` = 'published' order by `title` asc
---
            ->orderByDesc('created_at')
            ->get();

        return view('app', [
            'section' => 'simulation',
            'events' => $events,
            'scenarios' => Scenario::where('status', 'published')->orderBy('title')->get(),
        ]);

select * from `scenarios` where `status` = 'published' order by `title` asc
---
    public function create()
    {
        $this->authorizeEventAccess();

        return view('app', [
            'section' => 'simulation_create',
            'scenarios' => Scenario::where('status', 'published')->orderBy('title')->get(),
        ]);

select `resources`.*, `event_resource`.`simulation_event_id` as `pivot_simulation_event_id`, `event_resource`.`resource_id` as `pivot_resource_id`, `event_resource`.`quantity_needed` as `pivot_quantity_needed`, `event_resource`.`quantity_assigned` as `pivot_quantity_assigned`, `event_resource`.`status` as `pivot_status`, `event_resource`.`notes` as `pivot_notes`, `event_resource`.`created_at` as `pivot_created_at`, `event_resource`.`updated_at` as `pivot_updated_at` from `resources` inner join `event_resource` on `resources`.`id` = `event_resource`.`resource_id` where `event_resource`.`simulation_event_id` in (2)
---
    public function edit(SimulationEvent $simulationEvent)
    {
        $this->authorizeEventAccess();

        // Prevent editing of published, cancelled, or archived events
        if (in_array($simulationEvent->status, ['published', 'cancelled', 'archived'], true)) {
            return redirect()->route('simulation.events.index')
                ->with('status', 'This event cannot be edited. Unpublish or restore it first.');
        }

        // Load event with resources and ensure pivot data is included
        $simulationEvent->load(['scenario']);
        $simulationEvent->load(['resources' => function ($query) {
            $query->withPivot('quantity_needed', 'quantity_assigned', 'status', 'notes');
        }]);

        \Log::info('Editing event - Resources count:', [
            'event_id' => $simulationEvent->id,
            'resources_count' => $simulationEvent->resources->count(),
            'resources' => $simulationEvent->resources->toArray()
        ]);

        // Manually ensure resources array is properly formatted with pivot data
        $resourcesArray = $simulationEvent->resources->map(function ($resource) {
            $pivotData = [
                'quantity_needed' => $resource->pivot->quantity_needed ?? 1,
                'quantity_assigned' => $resource->pivot->quantity_assigned ?? 0,
                'status' => $resource->pivot->status ?? 'Planned',
                'notes' => $resource->pivot->notes ?? null,
            ];

            return [
                'id' => $resource->id,
                'name' => $resource->name,
                'category' => $resource->category,
                'available' => $resource->available,
                'quantity' => $resource->quantity,
                'pivot' => $pivotData
            ];
        })->toArray();

select * from `scenarios` where `status` = 'published' order by `title` asc
---
            'resources_sample' => isset($eventArray['resources']) && count($eventArray['resources']) > 0 ? $eventArray['resources'][0] : null
        ]);

        return view('app', [
            'section' => 'simulation_edit',
            'event' => $eventArray,
            'scenarios' => Scenario::where('status', 'published')->orderBy('title')->get(),
        ]);

select * from `simulation_events` where `status` = 'ongoing' and date(`event_date`) <= '2026-07-06'
---
    protected function autoCompleteExpiredEvents()
    {
        $now = now();

        SimulationEvent::where('status', 'ongoing')
            ->whereDate('event_date', '<=', $now->toDateString())
            ->get()
            ->each(function ($event) use ($now) {
                // Parse end time
                $endTime = $event->end_time; // Format: HH:MM
                if (!$endTime) return;

                try {
                    [$endHour, $endMinute] = explode(':', $endTime);
                    $eventEndDateTime = $event->event_date->copy()->setTime((int)$endHour, (int)$endMinute, 0);

                    // Check if current time is past the end time on the same date
                    if ($now->greaterThanOrEqualTo($eventEndDateTime)) {
                        $event->update([
                            'status' => 'completed',
                            'completed_at' => $now,
                            'updated_by' => portal_id(),
                        ]);
                    }
                } catch (\Exception $e) {
                    // Skip events with invalid time format
                    return;
                }

select `resources`.*, `event_resource`.`simulation_event_id` as `pivot_simulation_event_id`, `event_resource`.`resource_id` as `pivot_resource_id`, `event_resource`.`quantity_needed` as `pivot_quantity_needed`, `event_resource`.`quantity_assigned` as `pivot_quantity_assigned`, `event_resource`.`status` as `pivot_status`, `event_resource`.`notes` as `pivot_notes`, `event_resource`.`created_at` as `pivot_created_at`, `event_resource`.`updated_at` as `pivot_updated_at` from `resources` inner join `event_resource` on `resources`.`id` = `event_resource`.`resource_id` where `event_resource`.`simulation_event_id` in (2)
---
        // Reload the event to get updated status
        $simulationEvent->refresh();

        $simulationEvent->load([
            'scenario.trainingModule.lessons' => function ($query) {
                $query->orderBy('order');
            },
            'registrations',
            'resources',
        ]);