my-app/app/Http/Controllers/SimulationEventController.php

    public function index()
    {
        $user = portal_user();

        // Normalize event statuses before listing:
        // - Mark published events in the past that never started as "ended"
        SimulationEvent::autoEndPastUnstartedEvents($user?->id);

        // Participants see only:
        // - events they registered for (their batch / history)
        // - published open batches under campaigns they are enrolled in (rejoin after miss/cancel)
        if ($user && $user->role === 'PARTICIPANT') {
            $events = app(\App\Services\ParticipantSimulationEventVisibilityService::class)
                ->visibleEventsFor($user);

            return view('app', [
                'section' => 'simulation',
                'events' => $events,
            ]);
        }

        // Admin/Trainer see all events
        $this->authorizeEventAccess();

        // Auto-complete ongoing events that have passed their end time
        $this->autoCompleteExpiredEvents();

        $events = SimulationEvent::with([
            'scenario.trainingModule',
            'assignedTrainer',
            'creator',
            'trainingModule:id,title',
            'simulationExerciseTemplate:id,title,category,exercise_type',
            'campaignRequest:id,training_module_id,expected_participants,status',
            'campaignRequest.trainingModule:id,title',
            'resources' => function ($query) {
                $query->withPivot('quantity_needed', 'quantity_assigned', 'status', 'notes');
            },
            'registrations' => function ($query) {
                $query->where('status', 'approved')->with('user:id,name');
            },
            'attendances',
        ])
            ->withCount([
                'registrations',
                'registrations as approved_registrations_count' => function ($query) {
                    $query->where('status', 'approved');
                }
            ])
            ->orderByDesc('created_at')
            ->get();
---
select * from `attendances` where `attendances`.`simulation_event_id` in (1, 2)
select `id`, `name` from `users` where `users`.`id` in (14, 15, 16, 17, 18, 19, 24, 25, 26, 29, 31, 32, 33)
select `resources`.*, `event_resource`.`simulation_event_id` as `pivot_simulation_event_id`, `event_resource`.`resource_id` as `pivot_resource_id`, `event_resource`.`quantity_needed` as `pivot_quantity_needed`, `event_resource`.`quantity_assigned` as `pivot_quantity_assigned`, `event_resource`.`status` as `pivot_status`, `event_resource`.`notes` as `pivot_notes`, `event_resource`.`created_at` as `pivot_created_at`, `event_resource`.`updated_at` as `pivot_updated_at` from `resources` inner join `event_resource` on `resources`.`id` = `event_resource`.`resource_id` where `event_resource`.`simulation_event_id` in (1, 2)

        $user = portal_user();
        $canManageDemoTools = $user && in_array($user->role, ['LGU_ADMIN', 'SUPER_ADMIN'], true);

        return view('app', [
            'section' => 'simulation',
            'events' => $events,
            'approved_schedules' => $this->planningService->listApprovedSchedules()->values()->all(),
            'exercise_templates' => $exerciseTemplates,
            'exercise_template_summary' => [
                'total' => count($exerciseTemplates),
                'published' => collect($exerciseTemplates)->where('status', 'published')->count(),
                'draft' => collect($exerciseTemplates)->where('status', 'draft')->count(),
                'archived' => collect($exerciseTemplates)->where('status', 'archived')->count(),
            ],
            'scenarios' => Scenario::where('status', 'published')->orderBy('title')->get(),
            'demo_tools_enabled' => (bool) \App\Models\Setting::get('demo_tools_enabled', true),
            'can_manage_demo_tools' => $canManageDemoTools,
        ]);
---
select * from `scenarios` where `status` = 'published' order by `title` asc