my-app/app/Models/SimulationEvent.php

select `id`, `event_date`, `end_time` from `simulation_events` where `status` = 'published' and `actual_start_time` is null and date(`event_date`) <= '2026-07-07'
---
    public static function autoEndPastUnstartedEvents(?int $userId = null): void
    {
        $now = now();

        $candidates = static::where('status', 'published')
            ->whereNull('actual_start_time')
            ->whereDate('event_date', '<=', $now->toDateString())
            ->get(['id', 'event_date', 'end_time']);