my-app/app/Http/Controllers/Api/ResourceApiController.php

select * from `resources`
select count(*) as aggregate from `resources` where `status` = 'Available'
select count(*) as aggregate from `resources` where `status` = 'Partially Assigned'
select count(*) as aggregate from `resources` where `status` = 'Fully Assigned'
select count(*) as aggregate from `resources` where `condition` = 'Needs Repair' or `status` = 'Damaged'
---
    public function index(Request $request): JsonResponse
    {
        try {
            $query = Resource::query();

            if ($request->has('search')) {
                $query->where('name', 'like', "%{$request->search}%")
                      ->orWhere('serial_number', 'like', "%{$request->search}%");
            }

            if ($request->has('category') && $request->category !== 'all') {
                $query->where('category', $request->category);
            }

            if ($request->has('status') && $request->status !== 'all') {
                $query->where('status', $request->status);
            }

            if ($request->has('condition') && $request->condition !== 'all') {
                $query->where('condition', $request->condition);
            }

            $resources = $query->get();

            return response()->json([
                'resources' => $resources,
                'stats' => [
                    'total' => Resource::count(),
                    'available' => Resource::where('status', 'Available')->count(),
                    'partiallyAssigned' => Resource::where('status', 'Partially Assigned')->count(),
                    'fullyAssigned' => Resource::where('status', 'Fully Assigned')->count(),
                    'needsRepair' => Resource::where('condition', 'Needs Repair')->orWhere('status', 'Damaged')->count(),

select `id`, `title`, `event_date` from `simulation_events` where `status` = 'published' order by `event_date` desc
---
    public function getEvents(): JsonResponse
    {
        try {
            // Normalize statuses so stale published events are marked as ended
            SimulationEvent::autoEndPastUnstartedEvents(portal_id());

            $events = SimulationEvent::where('status', 'published')
                ->orderBy('event_date', 'desc')
                ->get(['id', 'title', 'event_date']);

select * from `simulation_events` where `status` in ('completed', 'ended') order by `event_date` desc
select `resources`.*, `event_resource`.`simulation_event_id` as `pivot_simulation_event_id`, `event_resource`.`resource_id` as `pivot_resource_id`, `event_resource`.`quantity_needed` as `pivot_quantity_needed`, `event_resource`.`quantity_assigned` as `pivot_quantity_assigned`, `event_resource`.`status` as `pivot_status`, `event_resource`.`notes` as `pivot_notes`, `event_resource`.`created_at` as `pivot_created_at`, `event_resource`.`updated_at` as `pivot_updated_at` from `resources` inner join `event_resource` on `resources`.`id` = `event_resource`.`resource_id` where `event_resource`.`simulation_event_id` in (1, 2) and `event_resource`.`quantity_assigned` > 0 and `event_resource`.`status` != 'Returned'
select * from `resource_event_assignments` where `status` = 'Active' and exists (select * from `simulation_events` where `resource_event_assignments`.`event_id` = `simulation_events`.`id` and `status` = 'completed')
---
    public function getCompletedEventResources(): JsonResponse
    {
        try {
            // Normalize statuses before querying so past, never-started events
            // are treated as "ended" and included in post-event flows.
            SimulationEvent::autoEndPastUnstartedEvents(portal_id());

            // Get completed events with their resource assignments
            $completedEvents = SimulationEvent::whereIn('status', ['completed', 'ended'])
                ->with(['resources' => function ($query) {
                    $query->wherePivot('quantity_assigned', '>', 0)
                          ->wherePivot('status', '!=', 'Returned');
                }])
                ->orderBy('event_date', 'desc')
                ->get();

            // Also get active resource assignments for completed events
            $activeAssignments = ResourceEventAssignment::where('status', 'Active')
                ->whereHas('event', function ($query) {
                    $query->where('status', 'completed');
                })
                ->with(['resource', 'event'])
                ->get();