my-app/app/Http/Controllers/Api/ResourceApiController.php

    public function index(Request $request): JsonResponse
    {
        try {
            $query = Resource::query();

            if ($request->has('search')) {
                $query->where('name', 'like', "%{$request->search}%")
                      ->orWhere('serial_number', 'like', "%{$request->search}%");
            }

            if ($request->has('category') && $request->category !== 'all') {
                $query->where('category', $request->category);
            }

            if ($request->has('status') && $request->status !== 'all') {
                $query->where('status', $request->status);
            }

            if ($request->has('condition') && $request->condition !== 'all') {
                $query->where('condition', $request->condition);
            }

            $resources = $query->with(['budgetProposal:id,reference_number,title,status'])->get();

            return response()->json([
                'resources' => $resources,
                'stats' => [
                    'total' => Resource::count(),
                    'available' => Resource::where('status', 'Available')->where('pending_quantity', 0)->count(),
                    'pendingApproval' => Resource::where(function ($query) {
                        $query->where('status', 'Pending Approval')
                            ->orWhere('pending_quantity', '>', 0);
                    })->count(),
                    'reserved' => Resource::where('status', 'Reserved')->count(),
                    'inUse' => Resource::where('status', 'In Use')->count(),
                    'partiallyAssigned' => Resource::where('status', 'Partially Assigned')->count(),
                    'fullyAssigned' => Resource::where('status', 'Fully Assigned')->count(),
                    'needsRepair' => Resource::where('condition', 'Needs Repair')->orWhere('status', 'Damaged')->count(),
                ],
            ]);
---
select count(*) as aggregate from `resources`