my-app/app/Services/HazardAssessment/HazardTrainingRecommendationService.php

    public function recommendTrainingModules(BarangayProfile $profile): array
    {
        $profile->loadMissing('hazardRecords');
        $hazards = $profile->hazardRecords;

        if ($hazards->isEmpty()) {
            return [];
        }

        $keywords = $this->collectRecommendationKeywords($hazards);
        $modules = TrainingModule::query()
            ->where('status', 'published')
            ->orderBy('title')
            ->get(['id', 'title', 'category']);
---
select `id`, `title`, `category` from `training_modules` where `status` = 'published' order by `title` asc

    public function suggestTrainers(BarangayProfile $profile): array
    {
        $profile->loadMissing('hazardRecords');
        $hazardTypes = $profile->hazardRecords->pluck('hazard_type')->unique();

        $query = QualifiedTrainer::fromStaffUsers()->active()->orderBy('name');

        if ($profile->barangay_name) {
            $query->where(function ($q) use ($profile) {
                $q->where('barangay', 'like', "%{$profile->barangay_name}%")
                    ->orWhereNull('barangay');
            });
        }

        return $query->get(['id', 'name', 'specialization'])
            ->filter(function (QualifiedTrainer $trainer) use ($hazardTypes) {
                if ($hazardTypes->isEmpty()) {
                    return true;
                }
                $spec = strtolower((string) $trainer->specialization);

                return $hazardTypes->contains(fn ($type) => str_contains($spec, strtolower($type)));
            })
            ->take(5)
            ->map(fn (QualifiedTrainer $t) => [
                'id' => $t->id,
                'name' => $t->name,
                'specialization' => $t->specialization,
            ])
            ->values()
            ->all();
---
select `id`, `name`, `specialization` from `qualified_trainers` where `status` = 'active' and (`barangay` like '%Bagong Silangan%' or `barangay` is null) order by `name` asc

    public function globalAnalytics(): array
    {
        $profiles = BarangayProfile::with('hazardRecords')->get();
        $summary = $this->dashboardSummary($profiles);

        $hazardDistribution = [];
        foreach (config('hazard_assessment.hazard_types', []) as $type) {
            $count = BarangayHazard::where('hazard_type', $type)->count();
            if ($count > 0) {
                $hazardDistribution[$type] = $count;
            }
        }

        $agencyDistribution = BarangayHazard::query()
            ->selectRaw('source_agency, COUNT(*) as total')
            ->groupBy('source_agency')
            ->orderByDesc('total')
            ->pluck('total', 'source_agency')
            ->all();
---
select * from `barangay_profiles`
select count(*) as aggregate from `barangay_hazards` where `hazard_type` = 'Flood'
select source_agency, COUNT(*) as total from `barangay_hazards` group by `source_agency` order by `total` desc