my-app/app/Http/Controllers/Admin/TrainingModuleController.php

    public function index(Request $request)
    {
        $perPage = 9;

        $query = TrainingModule::with('owner')
            ->withCount('contents as lesson_count')
            ->orderByDesc('updated_at');

        if ($request->filled('search')) {
            $search = $request->string('search')->trim();
            if ($search !== '') {
                $query->where(function ($builder) use ($search) {
                    $builder->where('title', 'like', "%{$search}%")
                        ->orWhere('short_description', 'like', "%{$search}%")
                        ->orWhere('description', 'like', "%{$search}%")
                        ->orWhere('category', 'like', "%{$search}%")
                        ->orWhere('related_hazard', 'like', "%{$search}%");
                });
            }
        }

        if ($request->filled('status')) {
            $query->where('status', $request->string('status'));
        }

        if ($request->filled('category')) {
            $query->where('category', $request->string('category'));
        }

        $paginator = $query->paginate($perPage)->withQueryString();
---
select * from `training_modules` order by `updated_at` desc limit 9 offset 0
select count(*) as aggregate from `training_modules`

    public function store(StoreTrainingModuleRequest $request)
    {
        $data = $request->validated();
        $data['owner_id'] = portal_id();
        $data['status'] = 'draft';
        $data['difficulty'] = $data['difficulty'] ?? 'Beginner';
        $data['short_description'] = $data['short_description'] ?? Str::limit((string) ($data['description'] ?? ''), 500, '');
        $data['related_hazard'] = $data['related_hazard'] ?? ($data['category'] ?? null);
        $data['delivery_method'] = $data['delivery_method'] ?? 'in_person';
        $data['target_audience'] = array_values(array_filter($data['target_audience'] ?? []));
        $data['assigned_qualified_trainer_ids'] = $this->normalizeTrainerIds($data['assigned_qualified_trainer_ids'] ?? []);
        $data['available_training_sessions'] = $this->normalizeTrainingSessions($data['available_training_sessions'] ?? []);
        $data['learning_objectives'] = $this->normalizeObjectives($data['learning_objectives'] ?? []);

        if (empty($data['learning_objectives'])) {
            return redirect()->back()
                ->withErrors(['learning_objectives' => 'At least one learning objective is required.'])
                ->withInput();
        }

        if ($request->hasFile('thumbnail')) {
            $data['thumbnail_path'] = $request->file('thumbnail')->store('training-module-thumbnails', 'public');
        }

        unset($data['thumbnail']);

        $module = TrainingModule::create($data);
---
insert into `training_modules` (`title`, `description`, `estimated_duration_minutes`, `difficulty`, `category`, `visibility`, `learning_objectives`, `owner_id`, `status`, `updated_at`, `created_at`) values ('Flood Response Simulation', 'This module immerses participants in a realistic, intermediate-level flood scenario to practice critical response actions and decision-making. Participants will apply their knowledge of flood preparedness plans, resource management, and communication protocols in a simulated environment, enhancing their readiness for actual flood events.', '60', 'Intermediate', 'Flood', 'all', '[\"Effectively execute pre-established flood response protocols and checklists within a simulated environment.\",\"Demonstrate clear and concise communication with relevant stakeholders during a rapidly evolving flood event.\",\"Make timely and appropriate resource allocation decisions under pressure to mitigate flood impacts.\"]', 3, 'draft', '2026-07-07 02:06:59', '2026-07-07 02:06:59')